src/toir_cfe/src/Reports/проф_НаработкаОборудования/проф_НаработкаОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>проф_НаработкаОборудования</name>
</mdclass:Report>

src/toir_cfe/src/AccumulationRegisters/торо_НаработкаОбъектовРемонта/торо_НаработкаОбъектовРемонта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="0fb2df8c-9107-4695-8e88-6b53458d126c">
  <name>торо_НаработкаОбъектовРемонта</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources extendedConfigurationObject="140c0589-4396-4fbd-aacc-7e0332bb4954">
    <name>Наработка</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>16</precision>
          <scale>5</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <attributes extendedConfigurationObject="f95e90a0-fbfa-4357-a315-5f5be5985494">
    <name>ДатаНач</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="08a971de-a5d1-48a0-901a-ac3249fa9ea3">
    <name>ДатаКон</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions extendedConfigurationObject="905523e1-ecd0-4a06-ada5-ae31c7486a96">
    <name>ОбъектРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="00273605-707e-4baf-9cba-4106f0447f06">
    <name>Показатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

src/toir_cfe/src/InformationRegisters/торо_МаксимальныеЗначенияНаработкиОР/торо_МаксимальныеЗначенияНаработкиОР.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="4d59b585-78df-4900-998a-fb2752666700">
  <name>торо_МаксимальныеЗначенияНаработкиОР</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="505ce38b-c0a0-46dd-9459-08db6b8e4b73">
    <name>НазначенныйРесурс</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="4dc81ec1-cefd-4479-a1b3-4cb056e33408">
    <name>МаксимальноеЗначение</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="70aa15af-eb4f-4d17-ae72-d8d8c1b9669a">
    <name>ОбъектРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="431961cf-c6de-4d74-8ff8-241c23a7e643">
    <name>Показатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

src/toir_cfe/src/Documents/торо_УчетНаработкиОборудования/торо_УчетНаработкиОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="f6d4f225-886e-46da-a5b3-a818328b1e21">
  <name>торо_УчетНаработкиОборудования</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="e680dbd7-a409-4f12-abeb-076ab266a46d">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="102c0b26-a0eb-4d40-9518-548637143fa6">
    <name>НаработкаОбъектов</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
</mdclass:Document>

src/toir_cfe/src/Reports/проф_НаработкаОборудования/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

//++ Проф-ИТ, #93, Башинская А.Ю., 16.09.2023

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	

	ТекИерархия = торо_ОтчетыСервер.ПолучитьЗначениеСтруктурыИерархии(КомпоновщикНастроек);

	торо_ОтчетыСервер.УстановитьЗапросыНаборовДанныхИерархииОР(СхемаКомпоновкиДанных, ТекИерархия, "ДатаОкончания");

	Если ТекИерархия.СтроитсяАвтоматически Тогда

		//++ Проф-ИТ, #93, Башинская А.Ю., 16.09.2023
		СхемаКомпоновкиДанных.НаборыДанных.Объекты.Запрос =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	торо_НаработкаОбъектовРемонта.Регистратор.Организация КАК Организация,
		|	торо_НаработкаОбъектовРемонта.ОбъектРемонта КАК ОбъектРемонта,
		|	торо_НаработкаОбъектовРемонта.Показатель КАК ПоказательНаработки,
		|	ВЫБОР
		|		КОГДА торо_НаработкаОбъектовРемонта.ДатаНач = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА торо_НаработкаОбъектовРемонта.ОбъектРемонта.ДатаВводаВЭксплуатацию
		|		ИНАЧЕ торо_НаработкаОбъектовРемонта.ДатаНач
		|	КОНЕЦ КАК НачалоПериода,
		|	торо_НаработкаОбъектовРемонта.ДатаКон КАК ОкончаниеПериода,
		|	торо_НаработкаОбъектовРемонта.Наработка КАК Наработка,
		|	торо_НаработкаОбъектовРемонта.Период КАК Период,
		|	торо_ОбъектыРемонта." + ТекИерархия.РеквизитОР + " КАК ОбъектИерархии,
		|	торо_МаксимальныеЗначенияНаработкиОР.НазначенныйРесурс КАК НазначенныйРесурс   
		|ПОМЕСТИТЬ ВременнаяТаблица
		|ИЗ
		|	РегистрНакопления.торо_НаработкаОбъектовРемонта КАК торо_НаработкаОбъектовРемонта
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
		|		ПО торо_НаработкаОбъектовРемонта.ОбъектРемонта = торо_ОбъектыРемонта.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_МаксимальныеЗначенияНаработкиОР КАК торо_МаксимальныеЗначенияНаработкиОР
		|		ПО торо_НаработкаОбъектовРемонта.ОбъектРемонта = торо_МаксимальныеЗначенияНаработкиОР.ОбъектРемонта
		|			И торо_НаработкаОбъектовРемонта.Показатель = торо_МаксимальныеЗначенияНаработкиОР.Показатель
		|ГДЕ
		|	торо_НаработкаОбъектовРемонта.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|	И НЕ торо_НаработкаОбъектовРемонта.Регистратор.Организация ЕСТЬ NULL
		|{ГДЕ
		|	(торо_НаработкаОбъектовРемонта.Период МЕЖДУ &ДатаНачала И &ДатаОкончания)}
		|		ИНДЕКСИРОВАТЬ ПО
		|	ОбъектРемонта
		|;
        |
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	торо_УчетНаработкиОборудованияНаработкаОбъектов.Объект КАК Объект,
		|	МАКСИМУМ(торо_УчетНаработкиОборудования.Дата) КАК Дата,
		|	торо_УчетНаработкиОборудованияНаработкаОбъектов.Показатель КАК Показатель
		|ПОМЕСТИТЬ ПоследниеНаработки
		|ИЗ
		|	Документ.торо_УчетНаработкиОборудования.НаработкаОбъектов КАК торо_УчетНаработкиОборудованияНаработкаОбъектов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_УчетНаработкиОборудования КАК торо_УчетНаработкиОборудования
		|		ПО торо_УчетНаработкиОборудованияНаработкаОбъектов.Ссылка = торо_УчетНаработкиОборудования.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблица КАК ВременнаяТаблица
		|		ПО торо_УчетНаработкиОборудованияНаработкаОбъектов.Объект = ВременнаяТаблица.ОбъектРемонта
		|			И торо_УчетНаработкиОборудованияНаработкаОбъектов.Показатель = ВременнаяТаблица.ПоказательНаработки
		|ГДЕ
		|	торо_УчетНаработкиОборудования.ПометкаУдаления = ЛОЖЬ
		|
		|СГРУППИРОВАТЬ ПО
		|	торо_УчетНаработкиОборудованияНаработкаОбъектов.Объект,
		|	торо_УчетНаработкиОборудованияНаработкаОбъектов.Показатель
		|;
        |                                       
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	торо_УчетНаработкиОборудованияНаработкаОбъектов.Объект КАК Объект,
		|	торо_УчетНаработкиОборудованияНаработкаОбъектов.НовоеЗначение КАК НовоеЗначение,
		|	торо_УчетНаработкиОборудованияНаработкаОбъектов.Показатель КАК Показатель
		|ПОМЕСТИТЬ СуммарныеНаработки
		|ИЗ
		|	ПоследниеНаработки КАК ПоследниеНаработки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_УчетНаработкиОборудования.НаработкаОбъектов КАК торо_УчетНаработкиОборудованияНаработкаОбъектов
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_УчетНаработкиОборудования КАК торо_УчетНаработкиОборудования
		|			ПО торо_УчетНаработкиОборудованияНаработкаОбъектов.Ссылка = торо_УчетНаработкиОборудования.Ссылка
		|		ПО (ПоследниеНаработки.Дата = торо_УчетНаработкиОборудования.Дата)
		|			И ПоследниеНаработки.Объект = торо_УчетНаработкиОборудованияНаработкаОбъектов.Объект
		|			И ПоследниеНаработки.Показатель = торо_УчетНаработкиОборудованияНаработкаОбъектов.Показатель
		|;
	  	|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблица.Организация КАК Организация,
		|	ВременнаяТаблица.ОбъектРемонта КАК ОбъектРемонта,
		|	ВременнаяТаблица.ПоказательНаработки КАК ПоказательНаработки,
		|	ВременнаяТаблица.НачалоПериода КАК НачалоПериода,
		|	ВременнаяТаблица.ОкончаниеПериода КАК ОкончаниеПериода,
		//++ Проф-ИТ, #296, Горетовская М.С., 05.10.2023 - Доработки по задаче #93		
		|	Выразить(ВременнаяТаблица.Наработка как Число(10,2)) КАК Наработка,
		//-- Проф-ИТ, #296, Горетовская М.С., 05.10.2023 - Доработки по задаче #93
		|	ВременнаяТаблица.Период КАК Период,
		|	ВременнаяТаблица.ОбъектИерархии КАК ОбъектИерархии,
		|	ВременнаяТаблица.НазначенныйРесурс КАК НазначенныйРесурс,
		//++ Проф-ИТ, #296, Горетовская М.С., 05.10.2023 - Доработки по задаче #93		
		|	Выразить(ЕСТЬNULL(СуммарныеНаработки.НовоеЗначение, 0) КАК Число(10,2)) КАК СуммарнаяНаработка
		//-- Проф-ИТ, #296, Горетовская М.С., 05.10.2023 - Доработки по задаче #93
		|ИЗ
		|	ВременнаяТаблица КАК ВременнаяТаблица
		|		ЛЕВОЕ СОЕДИНЕНИЕ СуммарныеНаработки КАК СуммарныеНаработки
		|		ПО ВременнаяТаблица.ОбъектРемонта = СуммарныеНаработки.Объект
		|			И ВременнаяТаблица.ПоказательНаработки = СуммарныеНаработки.Показатель";
		//-- Проф-ИТ, #93, Башинская А.Ю., 16.09.2023

        торо_ОтчетыКлиентСервер.УстановитьТипИерархическойГруппировкиВНастройках(КомпоновщикНастроек, "ОбъектИерархии", ТипГруппировкиКомпоновкиДанных.Иерархия);

	Иначе

		торо_ОтчетыКлиентСервер.УстановитьТипИерархическойГруппировкиВНастройках(КомпоновщикНастроек, "ОбъектИерархии", ТипГруппировкиКомпоновкиДанных.ТолькоИерархия);

		//++ Проф-ИТ, #93, Башинская А.Ю., 16.09.2023
		СхемаКомпоновкиДанных.НаборыДанных.Объекты.Запрос = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	торо_НаработкаОбъектовРемонта.Регистратор.Организация КАК Организация,
		|	торо_НаработкаОбъектовРемонта.ОбъектРемонта КАК ОбъектРемонта,
		|	торо_НаработкаОбъектовРемонта.Показатель КАК ПоказательНаработки,
		|	ВЫБОР
		|		КОГДА торо_НаработкаОбъектовРемонта.ДатаНач = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА торо_НаработкаОбъектовРемонта.ОбъектРемонта.ДатаВводаВЭксплуатацию
		|		ИНАЧЕ торо_НаработкаОбъектовРемонта.ДатаНач
		|	КОНЕЦ КАК НачалоПериода,
		|	торо_НаработкаОбъектовРемонта.ДатаКон КАК ОкончаниеПериода,
		|	торо_НаработкаОбъектовРемонта.Наработка КАК Наработка,
		|	торо_НаработкаОбъектовРемонта.Период КАК Период,
		|	торо_ОбъектыРемонта.Ссылка КАК ОбъектИерархии,
		|	торо_МаксимальныеЗначенияНаработкиОР.НазначенныйРесурс КАК НазначенныйРесурс 
		|ПОМЕСТИТЬ ВременнаяТаблица
		|ИЗ
		|	РегистрНакопления.торо_НаработкаОбъектовРемонта КАК торо_НаработкаОбъектовРемонта
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
		|		ПО торо_НаработкаОбъектовРемонта.ОбъектРемонта = торо_ОбъектыРемонта.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_МаксимальныеЗначенияНаработкиОР КАК торо_МаксимальныеЗначенияНаработкиОР
		|		ПО торо_НаработкаОбъектовРемонта.ОбъектРемонта = торо_МаксимальныеЗначенияНаработкиОР.ОбъектРемонта
		|			И торо_НаработкаОбъектовРемонта.Показатель = торо_МаксимальныеЗначенияНаработкиОР.Показатель
		|ГДЕ
		|	торо_НаработкаОбъектовРемонта.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|	И НЕ торо_НаработкаОбъектовРемонта.Регистратор.Организация ЕСТЬ NULL
		|{ГДЕ
		|	(торо_НаработкаОбъектовРемонта.Период МЕЖДУ &ДатаНачала И &ДатаОкончания)}
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	торо_УчетНаработкиОборудованияНаработкаОбъектов.Объект КАК Объект,
		|	МАКСИМУМ(торо_УчетНаработкиОборудования.Дата) КАК Дата,
		|	торо_УчетНаработкиОборудованияНаработкаОбъектов.Показатель КАК Показатель
		|ПОМЕСТИТЬ ПоследниеНаработки
		|ИЗ
		|	Документ.торо_УчетНаработкиОборудования.НаработкаОбъектов КАК торо_УчетНаработкиОборудованияНаработкаОбъектов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_УчетНаработкиОборудования КАК торо_УчетНаработкиОборудования
		|		ПО торо_УчетНаработкиОборудованияНаработкаОбъектов.Ссылка = торо_УчетНаработкиОборудования.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблица КАК ВременнаяТаблица
		|		ПО торо_УчетНаработкиОборудованияНаработкаОбъектов.Объект = ВременнаяТаблица.ОбъектРемонта
		|			И торо_УчетНаработкиОборудованияНаработкаОбъектов.Показатель = ВременнаяТаблица.ПоказательНаработки
		|ГДЕ
		|	торо_УчетНаработкиОборудования.ПометкаУдаления = ЛОЖЬ
		|
		|СГРУППИРОВАТЬ ПО
		|	торо_УчетНаработкиОборудованияНаработкаОбъектов.Объект,
		|	торо_УчетНаработкиОборудованияНаработкаОбъектов.Показатель
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	торо_УчетНаработкиОборудованияНаработкаОбъектов.Объект КАК Объект,
		|	торо_УчетНаработкиОборудованияНаработкаОбъектов.НовоеЗначение КАК НовоеЗначение,
		|	торо_УчетНаработкиОборудованияНаработкаОбъектов.Показатель КАК Показатель
		|ПОМЕСТИТЬ СуммарныеНаработки
		|ИЗ
		|	ПоследниеНаработки КАК ПоследниеНаработки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_УчетНаработкиОборудования.НаработкаОбъектов КАК торо_УчетНаработкиОборудованияНаработкаОбъектов
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_УчетНаработкиОборудования КАК торо_УчетНаработкиОборудования
		|			ПО торо_УчетНаработкиОборудованияНаработкаОбъектов.Ссылка = торо_УчетНаработкиОборудования.Ссылка
		|		ПО (ПоследниеНаработки.Дата = торо_УчетНаработкиОборудования.Дата)
		|			И ПоследниеНаработки.Объект = торо_УчетНаработкиОборудованияНаработкаОбъектов.Объект
		|			И ПоследниеНаработки.Показатель = торо_УчетНаработкиОборудованияНаработкаОбъектов.Показатель
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблица.Организация КАК Организация,
		|	ВременнаяТаблица.ОбъектРемонта КАК ОбъектРемонта,
		|	ВременнаяТаблица.ПоказательНаработки КАК ПоказательНаработки,
		|	ВременнаяТаблица.НачалоПериода КАК НачалоПериода,
		|	ВременнаяТаблица.ОкончаниеПериода КАК ОкончаниеПериода,
		//++ Проф-ИТ, #296, Горетовская М.С., 05.10.2023 - Доработки по задаче #93		
		|	Выразить(ВременнаяТаблица.Наработка как Число(10,2)) КАК Наработка,
		//-- Проф-ИТ, #296, Горетовская М.С., 05.10.2023 - Доработки по задаче #93
		|	ВременнаяТаблица.Период КАК Период,
		|	ВременнаяТаблица.ОбъектИерархии КАК ОбъектИерархии,
		|	ВременнаяТаблица.НазначенныйРесурс КАК НазначенныйРесурс,
		//++ Проф-ИТ, #296, Горетовская М.С., 05.10.2023 - Доработки по задаче #93		
		|	Выразить(ЕСТЬNULL(СуммарныеНаработки.НовоеЗначение, 0) как Число(10,2)) КАК СуммарнаяНаработка
		//-- Проф-ИТ, #296, Горетовская М.С., 05.10.2023 - Доработки по задаче #93
		|ИЗ
		|	ВременнаяТаблица КАК ВременнаяТаблица
		|		ЛЕВОЕ СОЕДИНЕНИЕ СуммарныеНаработки КАК СуммарныеНаработки
		|		ПО ВременнаяТаблица.ОбъектРемонта = СуммарныеНаработки.Объект
		|			И ВременнаяТаблица.ПоказательНаработки = СуммарныеНаработки.Показатель";		
		//-- Проф-ИТ, #93, Башинская А.Ю., 16.09.2023

	КонецЕсли;

	//++ Проф-ИТ, #296, Горетовская М.С., 05.10.2023 - Доработки по задаче #93
	ЭлементУО = КомпоновщикНастроек.Настройки.УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Формат", "ЧДЦ='2'");

	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("Наработка");
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СуммарнаяНаработка");
	
	ЭлементУО.Представление = "Формат: ЧДЦ='2' (Поля: Наработка, Суммарная наработка)";
 	ЭлементУО.Использование = Истина;

	КомпоновщикНастроек.ЗагрузитьНастройки(КомпоновщикНастроек.Настройки);
	//-- Проф-ИТ, #296, Горетовская М.С., 05.10.2023 - Доработки по задаче #93
	
КонецПроцедуры

//-- Проф-ИТ, #93, Башинская А.Ю., 16.09.2023

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//++ Проф-ИТ, #93, Башинская А.Ю., 16.09.2023

Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт
	
	Настройки.ЗагрузитьНастройкиПриИзмененииПараметров = ЗагрузитьНастройкиПриИзмененииПараметров();

КонецПроцедуры

Функция ЗагрузитьНастройкиПриИзмененииПараметров()  
	
	Параметры = Новый Массив;
	Параметры.Добавить(Новый ПараметрКомпоновкиДанных("ИерархияТип"));	
	Возврат Параметры;
	
КонецФункции

//-- Проф-ИТ, #93, Башинская А.Ю., 16.09.2023

#КонецОбласти

#КонецЕсли
